# Preparation Notebook
Author: Michael Schwabe

In [1]:
import pandas as pd
path = "data/"

In [2]:
df_train = pd.read_csv(path+"train.csv")
df_test = pd.read_csv(path+"test.csv")

In [3]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S
3,3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,NaN,S
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S

# Analysis for Preparation

In the exploration Task i identify some Feature their are very unusefull for prediction

Features with high cardinality and high distinction
* Name
* Cabin
* Ticket

Features with much missing values
* Cabin
* Ticket

unused Uniform Features
* Name
* PassengerID

interessting categrorical data
* SibSp (Childs)
* Parch (verwandte)
* Embarked (Zielhafen) - aber eigentlich auch egal!!!! Zu der Zeit k√∂nnte aber das Ziel mit der Klasse korellieren

ToDelete
* Name
* Cabin
* Ticket
* PassangerID

In [4]:
df_train.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S

In [6]:
del df_train["Cabin"]
del df_train["Name"]
del df_train["Ticket"]

In [7]:
df_train.head(1)

   PassengerId  Survived  Pclass   Sex  Age  SibSp  Parch   Fare Embarked
0            0         1       1  male  NaN      2      0  27.14        S

In [8]:
df_train.to_csv(path+"train_preprocess_lite.csv")

In [24]:
df_train = pd.read_csv(path+"train_preprocess_lite.csv")
del df_train["Unnamed: 0"]

In [25]:
df_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,100000.000000,100000.000000,100000.000000,96708.000000,100000.000000,100000.000000,99866.00000
mean,49999.500000,0.427740,2.106910,38.355472,0.397690,0.454560,43.92933
std,28867.657797,0.494753,0.837727,18.313556,0.862566,0.950076,69.58882
min,0.000000,0.000000,1.000000,0.080000,0.000000,0.000000,0.68000
25%,24999.750000,0.000000,1.000000,25.000000,0.000000,0.000000,10.04000
50%,49999.500000,0.000000,2.000000,39.000000,0.000000,0.000000,24.46000
75%,74999.250000,1.000000,3.000000,53.000000,1.000000,1.000000,33.50000
max,99999.000000,1.000000,3.000000,87.000000,8.000000,9.000000,744.66000

In [26]:
values = {'Age': 38}
df_train.fillna(value=values, inplace=True)

In [27]:
df_train

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,1,1,male,38.00,2,0,27.14,S
1,1,0,3,male,38.00,0,0,13.35,S
2,2,0,3,male,0.33,1,2,71.29,S
3,3,0,3,male,19.00,0,0,13.04,S
4,4,1,3,male,25.00,0,0,7.76,S
...,...,...,...,...,...,...,...,...,...
99995,99995,1,2,female,62.00,0,0,14.86,C
99996,99996,0,2,male,66.00,0,0,11.15,S
99997,99997,0,3,male,37.00,0,0,9.95,S
99998,99998,0,3,male,51.00,0,1,30.92,S
99999,99999,0,3,male,55.00,0,0,13.96,S

# OnehotEncoding, LabelEcoder or OrdinalMasking

Three Ways and fucking Two sides of the Medal ... 

**class sklearn.preprocessing.OrdinalEncoder(*, categories='auto', dtype=<class 'numpy.float64'>, handle_unknown='error', unknown_value=None)**
* https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.OrdinalEncoder.html#sklearn.preprocessing.OrdinalEncoder

**class sklearn.preprocessing.OneHotEncoder(*, categories='auto', drop=None, sparse=True, dtype=<class 'numpy.float64'>, handle_unknown='error')**
* https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.OneHotEncoder.html

**class sklearn.preprocessing.LabelEncoder**
* https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.LabelEncoder.html#sklearn.preprocessing.LabelEncoder

In [28]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import OrdinalEncoder